# Практическая работа по уроку "Динамическая типизация"
# 2. Создайте переменные разных типов данных:
name = 'Алексадр' #   - Создайте переменную name и присвойте ей значение вашего имени (строка).
print(name, type(name))       #   - Выведите значение переменной name на экран.
age = 51          #   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
print(age, type(age))        #   - Выведите значение переменной age на экран.
age = age + 1             #   - Перезапишите в age текущее значение переменной age + новое.
print(age, type(age))
is_student = True  # Создайте переменную is_student и присвойте ей значение True (логическое значение).
print("Is student:", is_student) #   - Выведите значение переменной is_student на экран.
