# Практическое задание по теме "Переменные"
# Напишите 4 переменных которые буду обозначать следующие данные:
# Количество выполненных ДЗ (запишите значение 12)
completed_tasks = 12
# Количество затраченных часов (запишите значение 1.5)
hours_spent = 1.5
# Название курса (запишите значение 'Python')
name = "Python"
# Время на одно задание (вычислить используя 1 и 2 переменные)
average_time = hours_spent / completed_tasks
# Выведите на экран(в консоль), используя переменные, следующую строку:
print("Курс:", name,", всего задач:", completed_tasks, ", затрачено часов:", hours_spent, ", среднее время выполнения", average_time, "часа.")
